MSP430 Assembler PC v4.3.1 Wed Oct 01 17:43:58 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0796410                         PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                             PC v4.3.1 *
       3            ;* Date/Time created: Wed Oct 01 17:43:58 2014                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=coffabi --hll_source=on --mem_model:code=large --mem_model:data=small --o
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("C:/ti/CC3000 SDK/MSP430FR5739/Basic WiFi Application/Basic WiFi 
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen PC v4.3.1 Copyright (c) 2003-2014 Te
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\CC3000 SDK\MSP430FR5739\Basic WiFi Application\Basic W
      12            ;*****************************************************************************
      13            ;* CINIT RECORDS                                                             *

C:\Users\x0135533\AppData\Local\Temp\0796410                         PAGE   51

    2505                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$21)
    2506                    .dwattr $C$DW$151, DW_AT_location[DW_OP_reg13]
    2507            $C$DW$152       .dwtag  DW_TAG_formal_parameter, DW_AT_name("fromlen")
    2508                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("fromlen")
    2509                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$21)
    2510                    .dwattr $C$DW$152, DW_AT_location[DW_OP_reg14]
    2511            
    2512            ;*****************************************************************************
    2513            ;* FUNCTION NAME: SimpleLinkWaitData                                         *
    2514            ;*                                                                           *
    2515            ;*   Regs Modified     : SR,r11,r12,r13,r14,r15                              *
    2516            ;*   Regs Used         : SR,r11,r12,r13,r14,r15                              *
    2517            ;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
    2518            ;*****************************************************************************
    2519            SimpleLinkWaitData:
    2520            ;* --------------------------------------------------------------------------*
    2521            ;* r12   assigned to pBuf
    2522            $C$DW$153       .dwtag  DW_TAG_variable, DW_AT_name("pBuf")
    2523                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("pBuf")
    2524                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$75)
    2525                    .dwattr $C$DW$153, DW_AT_location[DW_OP_reg12]
    2526            ;* r13   assigned to from
    2527            $C$DW$154       .dwtag  DW_TAG_variable, DW_AT_name("from")
    2528                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("from")
    2529                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$75)
    2530                    .dwattr $C$DW$154, DW_AT_location[DW_OP_reg13]
    2531            ;* r14   assigned to fromlen
    2532            $C$DW$155       .dwtag  DW_TAG_variable, DW_AT_name("fromlen")
    2533                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("fromlen")
    2534                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$75)
    2535                    .dwattr $C$DW$155, DW_AT_location[DW_OP_reg14]
    2536                    .dwcfi  cfa_offset, 4
    2537                    .dwcfi  save_reg_to_mem, 16, -4
    2538                    .dwpsn  file "C:/ti/CC3000 SDK/MSP430FR5739/Basic WiFi Application/Basic WiFi Source/Source/CC
    2539 000000 4392          MOV.W     #1,&tSLInformation+50 ; [] |857| 
         000002 0032!
    2540                    .dwpsn  file "C:/ti/CC3000 SDK/MSP430FR5739/Basic WiFi Application/Basic WiFi Source/Source/CC
    2541            $C$DW$156       .dwtag  DW_TAG_TI_branch
    2542                    .dwattr $C$DW$156, DW_AT_low_pc(0x00)
    2543                    .dwattr $C$DW$156, DW_AT_name("hci_event_handler")
    2544                    .dwattr $C$DW$156, DW_AT_TI_call
    2545                    .dwattr $C$DW$156, DW_AT_TI_return
    2546 000004 0080!         MOVX.A    #hci_event_handler,PC ; [] |858| 
         000006 0000 
    2547                                                      ; [] |858| 
    2548                    .dwattr $C$DW$149, DW_AT_TI_end_file("C:/ti/CC3000 SDK/MSP430FR5739/Basic WiFi Application/Bas
    2549                    .dwattr $C$DW$149, DW_AT_TI_end_line(0x35b)
    2550                    .dwattr $C$DW$149, DW_AT_TI_end_column(0x01)
    2551                    .dwendentry
    2552                    .dwendtag $C$DW$149
    2553            
    2554            ;*****************************************************************************
    2555            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    2556            ;*****************************************************************************
    2557                    .global UINT32_TO_STREAM_f
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:43:58 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0796410                         PAGE   52

    2558                    .global STREAM_TO_UINT16_f
    2559                    .global STREAM_TO_UINT32_f
    2560                    .global hci_patch_send
    2561                    .global SpiResumeSpi
    2562                    .global tSLInformation
    2563                    .global I_LSL
    2564                    .global L_LSL
    2565                    .global memcpy
    2566            
    2567            ;******************************************************************************
    2568            ;* BUILD ATTRIBUTES                                                           *
    2569            ;******************************************************************************
    2570                    .battr "TI", Tag_File, 1, Tag_ABI_enum_size(3)
    2571            
    2572            ;******************************************************************************
    2573            ;* TYPE INFORMATION                                                           *
    2574            ;******************************************************************************
    2575            
    2576            $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2577                    .dwattr $C$DW$T$46, DW_AT_byte_size(0x3e)
    2578            $C$DW$157       .dwtag  DW_TAG_member
    2579                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2580                    .dwattr $C$DW$157, DW_AT_name("usRxEventOpcode")
    2581                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("usRxEventOpcode")
    2582                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2583                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2584            $C$DW$158       .dwtag  DW_TAG_member
    2585                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2586                    .dwattr $C$DW$158, DW_AT_name("usEventOrDataReceived")
    2587                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("usEventOrDataReceived")
    2588                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2589                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2590            $C$DW$159       .dwtag  DW_TAG_member
    2591                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
    2592                    .dwattr $C$DW$159, DW_AT_name("pucReceivedData")
    2593                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("pucReceivedData")
    2594                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2595                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2596            $C$DW$160       .dwtag  DW_TAG_member
    2597                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$21)
    2598                    .dwattr $C$DW$160, DW_AT_name("pucTxCommandBuffer")
    2599                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("pucTxCommandBuffer")
    2600                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2601                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2602            $C$DW$161       .dwtag  DW_TAG_member
    2603                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$29)
    2604                    .dwattr $C$DW$161, DW_AT_name("sFWPatches")
    2605                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("sFWPatches")
    2606                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2607                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2608            $C$DW$162       .dwtag  DW_TAG_member
    2609                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$30)
    2610                    .dwattr $C$DW$162, DW_AT_name("sDriverPatches")
    2611                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("sDriverPatches")
    2612                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:43:58 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0796410                         PAGE   53

    2613                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2614            $C$DW$163       .dwtag  DW_TAG_member
    2615                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$31)
    2616                    .dwattr $C$DW$163, DW_AT_name("sBootLoaderPatches")
    2617                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("sBootLoaderPatches")
    2618                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2619                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2620            $C$DW$164       .dwtag  DW_TAG_member
    2621                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$35)
    2622                    .dwattr $C$DW$164, DW_AT_name("sWlanCB")
    2623                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("sWlanCB")
    2624                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2625                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2626            $C$DW$165       .dwtag  DW_TAG_member
    2627                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$38)
    2628                    .dwattr $C$DW$165, DW_AT_name("ReadWlanInterruptPin")
    2629                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("ReadWlanInterruptPin")
    2630                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2631                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2632            $C$DW$166       .dwtag  DW_TAG_member
    2633                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$41)
    2634                    .dwattr $C$DW$166, DW_AT_name("WlanInterruptEnable")
    2635                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("WlanInterruptEnable")
    2636                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2637                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2638            $C$DW$167       .dwtag  DW_TAG_member
    2639                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$42)
    2640                    .dwattr $C$DW$167, DW_AT_name("WlanInterruptDisable")
    2641                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("WlanInterruptDisable")
    2642                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2643                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2644            $C$DW$168       .dwtag  DW_TAG_member
    2645                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$45)
    2646                    .dwattr $C$DW$168, DW_AT_name("WriteWlanPin")
    2647                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("WriteWlanPin")
    2648                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2649                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2650            $C$DW$169       .dwtag  DW_TAG_member
    2651                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$32)
    2652                    .dwattr $C$DW$169, DW_AT_name("slTransmitDataError")
    2653                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("slTransmitDataError")
    2654                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2655                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2656            $C$DW$170       .dwtag  DW_TAG_member
    2657                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2658                    .dwattr $C$DW$170, DW_AT_name("usNumberOfFreeBuffers")
    2659                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("usNumberOfFreeBuffers")
    2660                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2661                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2662            $C$DW$171       .dwtag  DW_TAG_member
    2663                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2664                    .dwattr $C$DW$171, DW_AT_name("usSlBufferLength")
    2665                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("usSlBufferLength")
    2666                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2667                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:43:58 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0796410                         PAGE   54

    2668            $C$DW$172       .dwtag  DW_TAG_member
    2669                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2670                    .dwattr $C$DW$172, DW_AT_name("usBufferSize")
    2671                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("usBufferSize")
    2672                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2673                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2674            $C$DW$173       .dwtag  DW_TAG_member
    2675                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2676                    .dwattr $C$DW$173, DW_AT_name("usRxDataPending")
    2677                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("usRxDataPending")
    2678                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2679                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2680            $C$DW$174       .dwtag  DW_TAG_member
    2681                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$25)
    2682                    .dwattr $C$DW$174, DW_AT_name("NumberOfSentPackets")
    2683                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("NumberOfSentPackets")
    2684                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2685                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2686            $C$DW$175       .dwtag  DW_TAG_member
    2687                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$25)
    2688                    .dwattr $C$DW$175, DW_AT_name("NumberOfReleasedPackets")
    2689                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("NumberOfReleasedPackets")
    2690                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2691                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2692            $C$DW$176       .dwtag  DW_TAG_member
    2693                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    2694                    .dwattr $C$DW$176, DW_AT_name("InformHostOnTxComplete")
    2695                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("InformHostOnTxComplete")
    2696                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2697                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2698                    .dwendtag $C$DW$T$46
    2699            
    2700            $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("sSimplLinkInformation")
    2701                    .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$46)
    2702                    .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2703            $C$DW$T$57      .dwtag  DW_TAG_volatile_type
    2704                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2705            
    2706            $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2707                    .dwattr $C$DW$T$47, DW_AT_name("S3_1")
    2708                    .dwattr $C$DW$T$47, DW_AT_declaration
    2709                    .dwendtag $C$DW$T$47
    2710            
    2711            
    2712            $C$DW$T$49      .dwtag  DW_TAG_structure_type
    2713                    .dwattr $C$DW$T$49, DW_AT_name("S3_3")
    2714                    .dwattr $C$DW$T$49, DW_AT_declaration
    2715                    .dwendtag $C$DW$T$49
    2716            
    2717            
    2718            $C$DW$T$50      .dwtag  DW_TAG_union_type
    2719                    .dwattr $C$DW$T$50, DW_AT_name("U3_0")
    2720                    .dwattr $C$DW$T$50, DW_AT_declaration
    2721                    .dwendtag $C$DW$T$50
    2722            
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:43:58 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0796410                         PAGE   55

    2723            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2724                    .dwattr $C$DW$T$2, DW_AT_name("void")
    2725            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2726                    .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2727                    .dwattr $C$DW$T$3, DW_AT_address_class(0x10)
    2728            $C$DW$T$63      .dwtag  DW_TAG_const_type
    2729                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$3)
    2730            
    2731            $C$DW$T$33      .dwtag  DW_TAG_subroutine_type
    2732                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2733            $C$DW$177       .dwtag  DW_TAG_formal_parameter
    2734                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$32)
    2735            $C$DW$178       .dwtag  DW_TAG_formal_parameter
    2736                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$24)
    2737            $C$DW$179       .dwtag  DW_TAG_formal_parameter
    2738                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    2739                    .dwendtag $C$DW$T$33
    2740            
    2741            $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2742                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2743                    .dwattr $C$DW$T$34, DW_AT_address_class(0x14)
    2744            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanCB")
    2745                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    2746                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2747            
    2748            $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    2749                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2750            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    2751                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    2752                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    2753            $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptDisable")
    2754                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    2755                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2756            $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptEnable")
    2757                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2758                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2759            
    2760            $C$DW$T$43      .dwtag  DW_TAG_subroutine_type
    2761                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2762            $C$DW$180       .dwtag  DW_TAG_formal_parameter
    2763                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    2764                    .dwendtag $C$DW$T$43
    2765            
    2766            $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    2767                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    2768                    .dwattr $C$DW$T$44, DW_AT_address_class(0x14)
    2769            $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("tWriteWlanPin")
    2770                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2771                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2772            $C$DW$T$59      .dwtag  DW_TAG_const_type
    2773                    .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$2)
    2774            $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    2775                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2776                    .dwattr $C$DW$T$60, DW_AT_address_class(0x10)
    2777            $C$DW$T$4       .dwtag  DW_TAG_base_type
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:43:58 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0796410                         PAGE   56

    2778                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2779                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    2780                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2781            $C$DW$T$5       .dwtag  DW_TAG_base_type
    2782                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2783                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2784                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2785            $C$DW$T$6       .dwtag  DW_TAG_base_type
    2786                    .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2787                    .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2788                    .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2789            $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("UINT8")
    2790                    .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    2791                    .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2792            $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    2793                    .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    2794                    .dwattr $C$DW$T$21, DW_AT_address_class(0x10)
    2795            $C$DW$T$75      .dwtag  DW_TAG_const_type
    2796                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$21)
    2797            
    2798            $C$DW$T$51      .dwtag  DW_TAG_array_type
    2799                    .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$20)
    2800                    .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2801                    .dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
    2802            $C$DW$181       .dwtag  DW_TAG_subrange_type
    2803                    .dwattr $C$DW$181, DW_AT_upper_bound(0x03)
    2804                    .dwendtag $C$DW$T$51
    2805            
    2806            
    2807            $C$DW$T$48      .dwtag  DW_TAG_array_type
    2808                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$6)
    2809                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2810                    .dwattr $C$DW$T$48, DW_AT_byte_size(0x15)
    2811            $C$DW$182       .dwtag  DW_TAG_subrange_type
    2812                    .dwattr $C$DW$182, DW_AT_upper_bound(0x14)
    2813                    .dwendtag $C$DW$T$48
    2814            
    2815            $C$DW$T$7       .dwtag  DW_TAG_base_type
    2816                    .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2817                    .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2818                    .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    2819            $C$DW$T$8       .dwtag  DW_TAG_base_type
    2820                    .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2821                    .dwattr $C$DW$T$8, DW_AT_name("short")
    2822                    .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    2823            $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("INT16")
    2824                    .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$8)
    2825                    .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2826            $C$DW$T$9       .dwtag  DW_TAG_base_type
    2827                    .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2828                    .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2829                    .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    2830            $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("UINT16")
    2831                    .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2832                    .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:43:58 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0796410                         PAGE   57

    2833            $C$DW$T$89      .dwtag  DW_TAG_const_type
    2834                    .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$19)
    2835            $C$DW$T$10      .dwtag  DW_TAG_base_type
    2836                    .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2837                    .dwattr $C$DW$T$10, DW_AT_name("int")
    2838                    .dwattr $C$DW$T$10, DW_AT_byte_size(0x02)
    2839            $C$DW$T$11      .dwtag  DW_TAG_base_type
    2840                    .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2841                    .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2842                    .dwattr $C$DW$T$11, DW_AT_byte_size(0x02)
    2843            $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    2844                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$11)
    2845                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2846            $C$DW$T$12      .dwtag  DW_TAG_base_type
    2847                    .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2848                    .dwattr $C$DW$T$12, DW_AT_name("long")
    2849                    .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    2850            $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("INT32")
    2851                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$12)
    2852                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2853            $C$DW$T$96      .dwtag  DW_TAG_const_type
    2854                    .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$32)
    2855            
    2856            $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    2857                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$32)
    2858                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2859            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2860                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2861                    .dwattr $C$DW$T$37, DW_AT_address_class(0x14)
    2862            $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanReadInteruptPin")
    2863                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    2864                    .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2865            $C$DW$T$13      .dwtag  DW_TAG_base_type
    2866                    .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2867                    .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    2868                    .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    2869            $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("UINT32")
    2870                    .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    2871                    .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2872            $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    2873                    .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2874                    .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    2875            $C$DW$T$14      .dwtag  DW_TAG_base_type
    2876                    .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    2877                    .dwattr $C$DW$T$14, DW_AT_name("long long")
    2878                    .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    2879            $C$DW$T$15      .dwtag  DW_TAG_base_type
    2880                    .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    2881                    .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    2882                    .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    2883            $C$DW$T$16      .dwtag  DW_TAG_base_type
    2884                    .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    2885                    .dwattr $C$DW$T$16, DW_AT_name("float")
    2886                    .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    2887            $C$DW$T$17      .dwtag  DW_TAG_base_type
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:43:58 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0796410                         PAGE   58

    2888                    .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    2889                    .dwattr $C$DW$T$17, DW_AT_name("double")
    2890                    .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    2891            $C$DW$T$18      .dwtag  DW_TAG_base_type
    2892                    .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    2893                    .dwattr $C$DW$T$18, DW_AT_name("long double")
    2894                    .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    2895            $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CHAR")
    2896                    .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$6)
    2897                    .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2898            $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    2899                    .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    2900                    .dwattr $C$DW$T$24, DW_AT_address_class(0x10)
    2901            
    2902            $C$DW$T$27      .dwtag  DW_TAG_subroutine_type
    2903                    .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
    2904                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2905            $C$DW$183       .dwtag  DW_TAG_formal_parameter
    2906                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$26)
    2907                    .dwendtag $C$DW$T$27
    2908            
    2909            $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    2910                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2911                    .dwattr $C$DW$T$28, DW_AT_address_class(0x14)
    2912            $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("tBootLoaderPatches")
    2913                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    2914                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2915            $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("tDriverPatches")
    2916                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$28)
    2917                    .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2918            $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("tFWPatches")
    2919                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    2920                    .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2921            $C$DW$T$110     .dwtag  DW_TAG_const_type
    2922                    .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$24)
    2923            
    2924            $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2925                    .dwattr $C$DW$T$52, DW_AT_name("_bsd_getsockopt_return_t")
    2926                    .dwattr $C$DW$T$52, DW_AT_byte_size(0x05)
    2927            $C$DW$184       .dwtag  DW_TAG_member
    2928                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$51)
    2929                    .dwattr $C$DW$184, DW_AT_name("ucOptValue")
    2930                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("ucOptValue")
    2931                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2932                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2933            $C$DW$185       .dwtag  DW_TAG_member
    2934                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$23)
    2935                    .dwattr $C$DW$185, DW_AT_name("iStatus")
    2936                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("iStatus")
    2937                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2938                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2939                    .dwendtag $C$DW$T$52
    2940            
    2941            $C$DW$T$112     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdGetSockOptReturnParams")
    2942                    .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$52)
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:43:58 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0796410                         PAGE   59

    2943                    .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    2944            
    2945            $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2946                    .dwattr $C$DW$T$53, DW_AT_name("_bsd_read_return_t")
    2947                    .dwattr $C$DW$T$53, DW_AT_byte_size(0x0c)
    2948            $C$DW$186       .dwtag  DW_TAG_member
    2949                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$32)
    2950                    .dwattr $C$DW$186, DW_AT_name("iSocketDescriptor")
    2951                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("iSocketDescriptor")
    2952                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2953                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2954            $C$DW$187       .dwtag  DW_TAG_member
    2955                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$32)
    2956                    .dwattr $C$DW$187, DW_AT_name("iNumberOfBytes")
    2957                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("iNumberOfBytes")
    2958                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2959                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2960            $C$DW$188       .dwtag  DW_TAG_member
    2961                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$25)
    2962                    .dwattr $C$DW$188, DW_AT_name("uiFlags")
    2963                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("uiFlags")
    2964                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2965                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2966                    .dwendtag $C$DW$T$53
    2967            
    2968            $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdReadReturnParams")
    2969                    .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$53)
    2970                    .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    2971            
    2972            $C$DW$T$54      .dwtag  DW_TAG_structure_type
    2973                    .dwattr $C$DW$T$54, DW_AT_name("_netapp_pingreport_args")
    2974                    .dwattr $C$DW$T$54, DW_AT_byte_size(0x14)
    2975            $C$DW$189       .dwtag  DW_TAG_member
    2976                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$25)
    2977                    .dwattr $C$DW$189, DW_AT_name("packets_sent")
    2978                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("packets_sent")
    2979                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2980                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2981            $C$DW$190       .dwtag  DW_TAG_member
    2982                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$25)
    2983                    .dwattr $C$DW$190, DW_AT_name("packets_received")
    2984                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("packets_received")
    2985                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2986                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2987            $C$DW$191       .dwtag  DW_TAG_member
    2988                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$25)
    2989                    .dwattr $C$DW$191, DW_AT_name("min_round_time")
    2990                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("min_round_time")
    2991                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2992                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2993            $C$DW$192       .dwtag  DW_TAG_member
    2994                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$25)
    2995                    .dwattr $C$DW$192, DW_AT_name("max_round_time")
    2996                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("max_round_time")
    2997                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:43:58 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0796410                         PAGE   60

    2998                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2999            $C$DW$193       .dwtag  DW_TAG_member
    3000                    .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$25)
    3001                    .dwattr $C$DW$193, DW_AT_name("avg_round_time")
    3002                    .dwattr $C$DW$193, DW_AT_TI_symbol_name("avg_round_time")
    3003                    .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3004                    .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3005                    .dwendtag $C$DW$T$54
    3006            
    3007            $C$DW$T$115     .dwtag  DW_TAG_typedef, DW_AT_name("netapp_pingreport_args_t")
    3008                    .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$54)
    3009                    .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    3010                    .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    3011            
    3012            ;***************************************************************
    3013            ;* DWARF CIE ENTRIES                                           *
    3014            ;***************************************************************
    3015            
    3016            $C$DW$CIE       .dwcie 16
    3017                    .dwcfi  cfa_register, 1
    3018                    .dwcfi  cfa_offset, 0
    3019                    .dwcfi  same_value, 0
    3020                    .dwcfi  same_value, 1
    3021                    .dwcfi  undefined, 2
    3022                    .dwcfi  same_value, 3
    3023                    .dwcfi  same_value, 4
    3024                    .dwcfi  same_value, 5
    3025                    .dwcfi  same_value, 6
    3026                    .dwcfi  same_value, 7
    3027                    .dwcfi  same_value, 8
    3028                    .dwcfi  same_value, 9
    3029                    .dwcfi  same_value, 10
    3030                    .dwcfi  undefined, 11
    3031                    .dwcfi  undefined, 12
    3032                    .dwcfi  undefined, 13
    3033                    .dwcfi  undefined, 14
    3034                    .dwcfi  undefined, 15
    3035                    .dwcfi  undefined, 16
    3036                    .dwendentry
    3037            
    3038            ;***************************************************************
    3039            ;* DWARF REGISTER MAP                                          *
    3040            ;***************************************************************
    3041            
    3042            $C$DW$194       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("PC")
    3043                    .dwattr $C$DW$194, DW_AT_location[DW_OP_reg0]
    3044            $C$DW$195       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SP")
    3045                    .dwattr $C$DW$195, DW_AT_location[DW_OP_reg1]
    3046            $C$DW$196       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SR")
    3047                    .dwattr $C$DW$196, DW_AT_location[DW_OP_reg2]
    3048            $C$DW$197       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("CG")
    3049                    .dwattr $C$DW$197, DW_AT_location[DW_OP_reg3]
    3050            $C$DW$198       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r4")
    3051                    .dwattr $C$DW$198, DW_AT_location[DW_OP_reg4]
    3052            $C$DW$199       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r5")
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:43:58 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0796410                         PAGE   61

    3053                    .dwattr $C$DW$199, DW_AT_location[DW_OP_reg5]
    3054            $C$DW$200       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r6")
    3055                    .dwattr $C$DW$200, DW_AT_location[DW_OP_reg6]
    3056            $C$DW$201       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r7")
    3057                    .dwattr $C$DW$201, DW_AT_location[DW_OP_reg7]
    3058            $C$DW$202       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r8")
    3059                    .dwattr $C$DW$202, DW_AT_location[DW_OP_reg8]
    3060            $C$DW$203       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r9")
