MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                             PC v4.3.1 *
       3            ;* Date/Time created: Wed Oct 01 17:44:03 2014                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=coffabi --hll_source=on --mem_model:code=large --mem_model:data=small --o
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("C:/ti/CC3000 SDK/MSP430FR5739/Basic WiFi Application/Basic WiFi 
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen PC v4.3.1 Copyright (c) 2003-2014 Te
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\CC3000 SDK\MSP430FR5739\Basic WiFi Application\Basic W
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")

    4154                    .dwcfi  restore_reg, 10
    4155                    .dwcfi  cfa_offset, 4
    4156            $C$DW$381       .dwtag  DW_TAG_TI_branch
    4157                    .dwattr $C$DW$381, DW_AT_low_pc(0x00)
    4158                    .dwattr $C$DW$381, DW_AT_TI_return
    4159 000082 0110          RETA      ; [] 
    4160                    ; [] 
    4161                    .dwattr $C$DW$367, DW_AT_TI_end_file("C:/ti/CC3000 SDK/MSP430FR5739/Basic WiFi Application/Bas
    4162                    .dwattr $C$DW$367, DW_AT_TI_end_line(0x153)
    4163                    .dwattr $C$DW$367, DW_AT_TI_end_column(0x01)
    4164                    .dwendentry
    4165                    .dwendtag $C$DW$367
    4166            
    4167            ;******************************************************************************
    4168            ;* STRINGS                                                                    *
    4169            ;******************************************************************************
    4170 000000               .sect   ".const:.string"
    4171                    .align  2
    4172 000000 005F  $C$SL1: .string "_device-info",0
         000001 0064 
         000002 0065 
         000003 0076 
         000004 0069 
         000005 0063 
         000006 0065 
         000007 002D 
         000008 0069 
         000009 006E 
         00000a 0066 
         00000b 006F 
         00000c 0000 
    4173                    .align  2
    4174 00000e 005F  $C$SL2: .string "_udp",0
         00000f 0075 
         000010 0064 
         000011 0070 
         000012 0000 
    4175                    .align  2
    4176 000014 006C  $C$SL3: .string "local",0
         000015 006F 
         000016 0063 
         000017 0061 
         000018 006C 
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE   87

         000019 0000 
    4177                    .align  2
    4178 00001a 005F  $C$SL4: .string "_services",0
         00001b 0073 
         00001c 0065 
         00001d 0072 
         00001e 0076 
         00001f 0069 
         000020 0063 
         000021 0065 
         000022 0073 
         000023 0000 
    4179                    .align  2
    4180 000024 005F  $C$SL5: .string "_dns-sd",0
         000025 0064 
         000026 006E 
         000027 0073 
         000028 002D 
         000029 0073 
         00002a 0064 
         00002b 0000 
    4181                    .align  2
    4182 00002c 0064  $C$SL6: .string "dev=CC3000",0
         00002d 0065 
         00002e 0076 
         00002f 003D 
         000030 0043 
         000031 0043 
         000032 0033 
         000033 0030 
         000034 0030 
         000035 0030 
         000036 0000 
    4183                    .align  2
    4184 000038 0076  $C$SL7: .string "vendor=Texas-Instruments",0
         000039 0065 
         00003a 006E 
         00003b 0064 
         00003c 006F 
         00003d 0072 
         00003e 003D 
         00003f 0054 
         000040 0065 
         000041 0078 
         000042 0061 
         000043 0073 
         000044 002D 
         000045 0049 
         000046 006E 
         000047 0073 
         000048 0074 
         000049 0072 
         00004a 0075 
         00004b 006D 
         00004c 0065 
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE   88

         00004d 006E 
         00004e 0074 
         00004f 0073 
         000050 0000 
    4185            ;*****************************************************************************
    4186            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    4187            ;*****************************************************************************
    4188                    .global strlen
    4189                    .global memmove
    4190                    .global memset
    4191                    .global SimpleLinkWaitEvent
    4192                    .global SimpleLinkWaitData
    4193                    .global UINT32_TO_STREAM_f
    4194                    .global hci_command_send
    4195                    .global hci_data_send
    4196                    .global set_socket_active_status
    4197                    .global get_socket_active_status
    4198                    .global _Errno
    4199                    .global tSLInformation
    4200                    .global localIP
    4201                    .global memcpy
    4202            
    4203            ;******************************************************************************
    4204            ;* BUILD ATTRIBUTES                                                           *
    4205            ;******************************************************************************
    4206                    .battr "TI", Tag_File, 1, Tag_ABI_enum_size(3)
    4207            
    4208            ;******************************************************************************
    4209            ;* TYPE INFORMATION                                                           *
    4210            ;******************************************************************************
    4211            
    4212            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4213                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    4214            $C$DW$382       .dwtag  DW_TAG_member
    4215                    .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$21)
    4216                    .dwattr $C$DW$382, DW_AT_name("fds_bits")
    4217                    .dwattr $C$DW$382, DW_AT_TI_symbol_name("fds_bits")
    4218                    .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4219                    .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4220                    .dwendtag $C$DW$T$22
    4221            
    4222            $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("fd_set")
    4223                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$22)
    4224                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4225            $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    4226                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    4227                    .dwattr $C$DW$T$65, DW_AT_address_class(0x10)
    4228            $C$DW$T$66      .dwtag  DW_TAG_const_type
    4229                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    4230            
    4231            $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4232                    .dwattr $C$DW$T$49, DW_AT_byte_size(0x3e)
    4233            $C$DW$383       .dwtag  DW_TAG_member
    4234                    .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$23)
    4235                    .dwattr $C$DW$383, DW_AT_name("usRxEventOpcode")
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE   89

    4236                    .dwattr $C$DW$383, DW_AT_TI_symbol_name("usRxEventOpcode")
    4237                    .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4238                    .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4239            $C$DW$384       .dwtag  DW_TAG_member
    4240                    .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$23)
    4241                    .dwattr $C$DW$384, DW_AT_name("usEventOrDataReceived")
    4242                    .dwattr $C$DW$384, DW_AT_TI_symbol_name("usEventOrDataReceived")
    4243                    .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4244                    .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4245            $C$DW$385       .dwtag  DW_TAG_member
    4246                    .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$25)
    4247                    .dwattr $C$DW$385, DW_AT_name("pucReceivedData")
    4248                    .dwattr $C$DW$385, DW_AT_TI_symbol_name("pucReceivedData")
    4249                    .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4250                    .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4251            $C$DW$386       .dwtag  DW_TAG_member
    4252                    .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$25)
    4253                    .dwattr $C$DW$386, DW_AT_name("pucTxCommandBuffer")
    4254                    .dwattr $C$DW$386, DW_AT_TI_symbol_name("pucTxCommandBuffer")
    4255                    .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4256                    .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4257            $C$DW$387       .dwtag  DW_TAG_member
    4258                    .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$33)
    4259                    .dwattr $C$DW$387, DW_AT_name("sFWPatches")
    4260                    .dwattr $C$DW$387, DW_AT_TI_symbol_name("sFWPatches")
    4261                    .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4262                    .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4263            $C$DW$388       .dwtag  DW_TAG_member
    4264                    .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$34)
    4265                    .dwattr $C$DW$388, DW_AT_name("sDriverPatches")
    4266                    .dwattr $C$DW$388, DW_AT_TI_symbol_name("sDriverPatches")
    4267                    .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4268                    .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4269            $C$DW$389       .dwtag  DW_TAG_member
    4270                    .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$35)
    4271                    .dwattr $C$DW$389, DW_AT_name("sBootLoaderPatches")
    4272                    .dwattr $C$DW$389, DW_AT_TI_symbol_name("sBootLoaderPatches")
    4273                    .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4274                    .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4275            $C$DW$390       .dwtag  DW_TAG_member
    4276                    .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$38)
    4277                    .dwattr $C$DW$390, DW_AT_name("sWlanCB")
    4278                    .dwattr $C$DW$390, DW_AT_TI_symbol_name("sWlanCB")
    4279                    .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4280                    .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4281            $C$DW$391       .dwtag  DW_TAG_member
    4282                    .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$41)
    4283                    .dwattr $C$DW$391, DW_AT_name("ReadWlanInterruptPin")
    4284                    .dwattr $C$DW$391, DW_AT_TI_symbol_name("ReadWlanInterruptPin")
    4285                    .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4286                    .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4287            $C$DW$392       .dwtag  DW_TAG_member
    4288                    .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$44)
    4289                    .dwattr $C$DW$392, DW_AT_name("WlanInterruptEnable")
    4290                    .dwattr $C$DW$392, DW_AT_TI_symbol_name("WlanInterruptEnable")
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE   90

    4291                    .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4292                    .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4293            $C$DW$393       .dwtag  DW_TAG_member
    4294                    .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$45)
    4295                    .dwattr $C$DW$393, DW_AT_name("WlanInterruptDisable")
    4296                    .dwattr $C$DW$393, DW_AT_TI_symbol_name("WlanInterruptDisable")
    4297                    .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4298                    .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4299            $C$DW$394       .dwtag  DW_TAG_member
    4300                    .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$48)
    4301                    .dwattr $C$DW$394, DW_AT_name("WriteWlanPin")
    4302                    .dwattr $C$DW$394, DW_AT_TI_symbol_name("WriteWlanPin")
    4303                    .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4304                    .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4305            $C$DW$395       .dwtag  DW_TAG_member
    4306                    .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
    4307                    .dwattr $C$DW$395, DW_AT_name("slTransmitDataError")
    4308                    .dwattr $C$DW$395, DW_AT_TI_symbol_name("slTransmitDataError")
    4309                    .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4310                    .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4311            $C$DW$396       .dwtag  DW_TAG_member
    4312                    .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$23)
    4313                    .dwattr $C$DW$396, DW_AT_name("usNumberOfFreeBuffers")
    4314                    .dwattr $C$DW$396, DW_AT_TI_symbol_name("usNumberOfFreeBuffers")
    4315                    .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4316                    .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4317            $C$DW$397       .dwtag  DW_TAG_member
    4318                    .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$23)
    4319                    .dwattr $C$DW$397, DW_AT_name("usSlBufferLength")
    4320                    .dwattr $C$DW$397, DW_AT_TI_symbol_name("usSlBufferLength")
    4321                    .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4322                    .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4323            $C$DW$398       .dwtag  DW_TAG_member
    4324                    .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$23)
    4325                    .dwattr $C$DW$398, DW_AT_name("usBufferSize")
    4326                    .dwattr $C$DW$398, DW_AT_TI_symbol_name("usBufferSize")
    4327                    .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4328                    .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4329            $C$DW$399       .dwtag  DW_TAG_member
    4330                    .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$23)
    4331                    .dwattr $C$DW$399, DW_AT_name("usRxDataPending")
    4332                    .dwattr $C$DW$399, DW_AT_TI_symbol_name("usRxDataPending")
    4333                    .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4334                    .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4335            $C$DW$400       .dwtag  DW_TAG_member
    4336                    .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$29)
    4337                    .dwattr $C$DW$400, DW_AT_name("NumberOfSentPackets")
    4338                    .dwattr $C$DW$400, DW_AT_TI_symbol_name("NumberOfSentPackets")
    4339                    .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4340                    .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4341            $C$DW$401       .dwtag  DW_TAG_member
    4342                    .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$29)
    4343                    .dwattr $C$DW$401, DW_AT_name("NumberOfReleasedPackets")
    4344                    .dwattr $C$DW$401, DW_AT_TI_symbol_name("NumberOfReleasedPackets")
    4345                    .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE   91

    4346                    .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4347            $C$DW$402       .dwtag  DW_TAG_member
    4348                    .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$24)
    4349                    .dwattr $C$DW$402, DW_AT_name("InformHostOnTxComplete")
    4350                    .dwattr $C$DW$402, DW_AT_TI_symbol_name("InformHostOnTxComplete")
    4351                    .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4352                    .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4353                    .dwendtag $C$DW$T$49
    4354            
    4355            $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("sSimplLinkInformation")
    4356                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$49)
    4357                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    4358            $C$DW$T$69      .dwtag  DW_TAG_volatile_type
    4359                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    4360            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4361                    .dwattr $C$DW$T$2, DW_AT_name("void")
    4362            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4363                    .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    4364                    .dwattr $C$DW$T$3, DW_AT_address_class(0x10)
    4365            $C$DW$T$77      .dwtag  DW_TAG_const_type
    4366                    .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$3)
    4367            
    4368            $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    4369                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4370            $C$DW$403       .dwtag  DW_TAG_formal_parameter
    4371                    .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$19)
    4372            $C$DW$404       .dwtag  DW_TAG_formal_parameter
    4373                    .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$28)
    4374            $C$DW$405       .dwtag  DW_TAG_formal_parameter
    4375                    .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$24)
    4376                    .dwendtag $C$DW$T$36
    4377            
    4378            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4379                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    4380                    .dwattr $C$DW$T$37, DW_AT_address_class(0x14)
    4381            $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanCB")
    4382                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4383                    .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4384            
    4385            $C$DW$T$42      .dwtag  DW_TAG_subroutine_type
    4386                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4387            $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4388                    .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4389                    .dwattr $C$DW$T$43, DW_AT_address_class(0x14)
    4390            $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptDisable")
    4391                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$43)
    4392                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4393            $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptEnable")
    4394                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4395                    .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4396            
    4397            $C$DW$T$46      .dwtag  DW_TAG_subroutine_type
    4398                    .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4399            $C$DW$406       .dwtag  DW_TAG_formal_parameter
    4400                    .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$24)
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE   92

    4401                    .dwendtag $C$DW$T$46
    4402            
    4403            $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    4404                    .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4405                    .dwattr $C$DW$T$47, DW_AT_address_class(0x14)
    4406            $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("tWriteWlanPin")
    4407                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    4408                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4409            $C$DW$T$70      .dwtag  DW_TAG_const_type
    4410                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$2)
    4411            $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    4412                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    4413                    .dwattr $C$DW$T$71, DW_AT_address_class(0x10)
    4414            $C$DW$T$78      .dwtag  DW_TAG_const_type
    4415                    .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$71)
    4416            $C$DW$T$4       .dwtag  DW_TAG_base_type
    4417                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4418                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    4419                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4420            $C$DW$T$5       .dwtag  DW_TAG_base_type
    4421                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4422                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4423                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4424            $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("INT8")
    4425                    .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$5)
    4426                    .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4427            $C$DW$T$6       .dwtag  DW_TAG_base_type
    4428                    .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4429                    .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4430                    .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4431            $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("UINT8")
    4432                    .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$6)
    4433                    .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    4434            $C$DW$T$86      .dwtag  DW_TAG_const_type
    4435                    .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$24)
    4436            $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    4437                    .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    4438                    .dwattr $C$DW$T$87, DW_AT_address_class(0x10)
    4439            $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    4440                    .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    4441                    .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
    4442            
    4443            $C$DW$T$53      .dwtag  DW_TAG_array_type
    4444                    .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$24)
    4445                    .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4446                    .dwattr $C$DW$T$53, DW_AT_byte_size(0x04)
    4447            $C$DW$407       .dwtag  DW_TAG_subrange_type
    4448                    .dwattr $C$DW$407, DW_AT_upper_bound(0x03)
    4449                    .dwendtag $C$DW$T$53
    4450            
    4451            
    4452            $C$DW$T$57      .dwtag  DW_TAG_array_type
    4453                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$24)
    4454                    .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4455                    .dwattr $C$DW$T$57, DW_AT_byte_size(0x0e)
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE   93

    4456            $C$DW$408       .dwtag  DW_TAG_subrange_type
    4457                    .dwattr $C$DW$408, DW_AT_upper_bound(0x0d)
    4458                    .dwendtag $C$DW$T$57
    4459            
    4460            $C$DW$T$7       .dwtag  DW_TAG_base_type
    4461                    .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4462                    .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4463                    .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    4464            $C$DW$T$8       .dwtag  DW_TAG_base_type
    4465                    .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4466                    .dwattr $C$DW$T$8, DW_AT_name("short")
    4467                    .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    4468            $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("INT16")
    4469                    .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$8)
    4470                    .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    4471            $C$DW$T$97      .dwtag  DW_TAG_const_type
    4472                    .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    4473            $C$DW$T$9       .dwtag  DW_TAG_base_type
    4474                    .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4475                    .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4476                    .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    4477            $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("UINT16")
    4478                    .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$9)
    4479                    .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    4480            $C$DW$T$116     .dwtag  DW_TAG_const_type
    4481                    .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$23)
    4482            $C$DW$T$10      .dwtag  DW_TAG_base_type
    4483                    .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4484                    .dwattr $C$DW$T$10, DW_AT_name("int")
    4485                    .dwattr $C$DW$T$10, DW_AT_byte_size(0x02)
    4486            $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("INT")
    4487                    .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$10)
    4488                    .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    4489            $C$DW$T$11      .dwtag  DW_TAG_base_type
    4490                    .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4491                    .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4492                    .dwattr $C$DW$T$11, DW_AT_byte_size(0x02)
    4493            $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    4494                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$11)
    4495                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4496            $C$DW$T$12      .dwtag  DW_TAG_base_type
    4497                    .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4498                    .dwattr $C$DW$T$12, DW_AT_name("long")
    4499                    .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    4500            $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("INT32")
    4501                    .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$12)
    4502                    .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4503            $C$DW$T$148     .dwtag  DW_TAG_const_type
    4504                    .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$19)
    4505            
    4506            $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    4507                    .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$19)
    4508                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4509            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    4510                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE   94

    4511                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    4512            $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanReadInteruptPin")
    4513                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    4514                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4515            $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("__fd_mask")
    4516                    .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    4517                    .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4518            
    4519            $C$DW$T$21      .dwtag  DW_TAG_array_type
    4520                    .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    4521                    .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    4522                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    4523            $C$DW$409       .dwtag  DW_TAG_subrange_type
    4524                    .dwattr $C$DW$409, DW_AT_upper_bound(0x00)
    4525                    .dwendtag $C$DW$T$21
    4526            
    4527            $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("suseconds_t")
    4528                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$19)
    4529                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4530            $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("time_t")
    4531                    .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$19)
    4532                    .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    4533            $C$DW$T$13      .dwtag  DW_TAG_base_type
    4534                    .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4535                    .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4536                    .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    4537            $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("UINT32")
    4538                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$13)
    4539                    .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4540            $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    4541                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    4542                    .dwattr $C$DW$T$30, DW_AT_address_class(0x10)
    4543            $C$DW$T$167     .dwtag  DW_TAG_const_type
    4544                    .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$30)
    4545            $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("socklen_t")
    4546                    .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$29)
    4547                    .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    4548            $C$DW$T$104     .dwtag  DW_TAG_pointer_type
    4549                    .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$102)
    4550                    .dwattr $C$DW$T$104, DW_AT_address_class(0x10)
    4551            $C$DW$T$168     .dwtag  DW_TAG_const_type
    4552                    .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$104)
    4553            $C$DW$T$169     .dwtag  DW_TAG_const_type
    4554                    .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$102)
    4555            $C$DW$T$14      .dwtag  DW_TAG_base_type
    4556                    .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4557                    .dwattr $C$DW$T$14, DW_AT_name("long long")
    4558                    .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    4559            $C$DW$T$15      .dwtag  DW_TAG_base_type
    4560                    .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4561                    .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4562                    .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    4563            $C$DW$T$16      .dwtag  DW_TAG_base_type
    4564                    .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4565                    .dwattr $C$DW$T$16, DW_AT_name("float")
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE   95

    4566                    .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    4567            $C$DW$T$17      .dwtag  DW_TAG_base_type
    4568                    .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4569                    .dwattr $C$DW$T$17, DW_AT_name("double")
    4570                    .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    4571            $C$DW$T$18      .dwtag  DW_TAG_base_type
    4572                    .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4573                    .dwattr $C$DW$T$18, DW_AT_name("long double")
    4574                    .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    4575            $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CHAR")
    4576                    .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$6)
    4577                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4578            $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    4579                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    4580                    .dwattr $C$DW$T$28, DW_AT_address_class(0x10)
    4581            
    4582            $C$DW$T$31      .dwtag  DW_TAG_subroutine_type
    4583                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    4584                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4585            $C$DW$410       .dwtag  DW_TAG_formal_parameter
    4586                    .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$30)
    4587                    .dwendtag $C$DW$T$31
    4588            
    4589            $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    4590                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    4591                    .dwattr $C$DW$T$32, DW_AT_address_class(0x14)
    4592            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("tBootLoaderPatches")
    4593                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$32)
    4594                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4595            $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("tDriverPatches")
    4596                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$32)
    4597                    .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4598            $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("tFWPatches")
    4599                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4600                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4601            $C$DW$T$174     .dwtag  DW_TAG_const_type
    4602                    .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$28)
    4603            
    4604            $C$DW$T$175     .dwtag  DW_TAG_array_type
    4605                    .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$27)
    4606                    .dwattr $C$DW$T$175, DW_AT_language(DW_LANG_C)
    4607                    .dwattr $C$DW$T$175, DW_AT_byte_size(0xdc)
    4608            $C$DW$411       .dwtag  DW_TAG_subrange_type
    4609                    .dwattr $C$DW$411, DW_AT_upper_bound(0xdb)
    4610                    .dwendtag $C$DW$T$175
    4611            
    4612            $C$DW$T$137     .dwtag  DW_TAG_const_type
    4613                    .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$6)
    4614            $C$DW$T$138     .dwtag  DW_TAG_pointer_type
    4615                    .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$137)
    4616                    .dwattr $C$DW$T$138, DW_AT_address_class(0x10)
    4617            
    4618            $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4619                    .dwattr $C$DW$T$51, DW_AT_name("_bsd_accept_return_t")
    4620                    .dwattr $C$DW$T$51, DW_AT_byte_size(0x18)
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE   96

    4621            $C$DW$412       .dwtag  DW_TAG_member
    4622                    .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
    4623                    .dwattr $C$DW$412, DW_AT_name("iSocketDescriptor")
    4624                    .dwattr $C$DW$412, DW_AT_TI_symbol_name("iSocketDescriptor")
    4625                    .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4626                    .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4627            $C$DW$413       .dwtag  DW_TAG_member
    4628                    .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
    4629                    .dwattr $C$DW$413, DW_AT_name("iStatus")
    4630                    .dwattr $C$DW$413, DW_AT_TI_symbol_name("iStatus")
    4631                    .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4632                    .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4633            $C$DW$414       .dwtag  DW_TAG_member
    4634                    .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$50)
    4635                    .dwattr $C$DW$414, DW_AT_name("tSocketAddress")
    4636                    .dwattr $C$DW$414, DW_AT_TI_symbol_name("tSocketAddress")
    4637                    .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4638                    .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4639                    .dwendtag $C$DW$T$51
    4640            
    4641            $C$DW$T$177     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdReturnParams")
    4642                    .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$51)
    4643                    .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
    4644            
    4645            $C$DW$T$52      .dwtag  DW_TAG_structure_type
    4646                    .dwattr $C$DW$T$52, DW_AT_name("_bsd_gethostbyname_return_t")
    4647                    .dwattr $C$DW$T$52, DW_AT_byte_size(0x08)
    4648            $C$DW$415       .dwtag  DW_TAG_member
    4649                    .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$19)
    4650                    .dwattr $C$DW$415, DW_AT_name("retVal")
    4651                    .dwattr $C$DW$415, DW_AT_TI_symbol_name("retVal")
    4652                    .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4653                    .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4654            $C$DW$416       .dwtag  DW_TAG_member
    4655                    .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$19)
    4656                    .dwattr $C$DW$416, DW_AT_name("outputAddress")
    4657                    .dwattr $C$DW$416, DW_AT_TI_symbol_name("outputAddress")
    4658                    .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4659                    .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4660                    .dwendtag $C$DW$T$52
    4661            
    4662            $C$DW$T$179     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdGethostbynameParams")
    4663                    .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$52)
    4664                    .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    4665            
    4666            $C$DW$T$54      .dwtag  DW_TAG_structure_type
    4667                    .dwattr $C$DW$T$54, DW_AT_name("_bsd_getsockopt_return_t")
    4668                    .dwattr $C$DW$T$54, DW_AT_byte_size(0x05)
    4669            $C$DW$417       .dwtag  DW_TAG_member
    4670                    .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$53)
    4671                    .dwattr $C$DW$417, DW_AT_name("ucOptValue")
    4672                    .dwattr $C$DW$417, DW_AT_TI_symbol_name("ucOptValue")
    4673                    .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4674                    .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4675            $C$DW$418       .dwtag  DW_TAG_member
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE   97

    4676                    .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$27)
    4677                    .dwattr $C$DW$418, DW_AT_name("iStatus")
    4678                    .dwattr $C$DW$418, DW_AT_TI_symbol_name("iStatus")
    4679                    .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4680                    .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4681                    .dwendtag $C$DW$T$54
    4682            
    4683            $C$DW$T$181     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdGetSockOptReturnParams")
    4684                    .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$54)
    4685                    .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    4686            
    4687            $C$DW$T$55      .dwtag  DW_TAG_structure_type
    4688                    .dwattr $C$DW$T$55, DW_AT_name("_bsd_read_return_t")
    4689                    .dwattr $C$DW$T$55, DW_AT_byte_size(0x0c)
    4690            $C$DW$419       .dwtag  DW_TAG_member
    4691                    .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$19)
    4692                    .dwattr $C$DW$419, DW_AT_name("iSocketDescriptor")
    4693                    .dwattr $C$DW$419, DW_AT_TI_symbol_name("iSocketDescriptor")
    4694                    .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4695                    .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4696            $C$DW$420       .dwtag  DW_TAG_member
    4697                    .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$19)
    4698                    .dwattr $C$DW$420, DW_AT_name("iNumberOfBytes")
    4699                    .dwattr $C$DW$420, DW_AT_TI_symbol_name("iNumberOfBytes")
    4700                    .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4701                    .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4702            $C$DW$421       .dwtag  DW_TAG_member
    4703                    .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$29)
    4704                    .dwattr $C$DW$421, DW_AT_name("uiFlags")
    4705                    .dwattr $C$DW$421, DW_AT_TI_symbol_name("uiFlags")
    4706                    .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4707                    .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4708                    .dwendtag $C$DW$T$55
    4709            
    4710            $C$DW$T$183     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdReadReturnParams")
    4711                    .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$55)
    4712                    .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    4713            
    4714            $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4715                    .dwattr $C$DW$T$56, DW_AT_name("_bsd_select_return_t")
    4716                    .dwattr $C$DW$T$56, DW_AT_byte_size(0x10)
    4717            $C$DW$422       .dwtag  DW_TAG_member
    4718                    .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$19)
    4719                    .dwattr $C$DW$422, DW_AT_name("iStatus")
    4720                    .dwattr $C$DW$422, DW_AT_TI_symbol_name("iStatus")
    4721                    .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4722                    .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4723            $C$DW$423       .dwtag  DW_TAG_member
    4724                    .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$29)
    4725                    .dwattr $C$DW$423, DW_AT_name("uiRdfd")
    4726                    .dwattr $C$DW$423, DW_AT_TI_symbol_name("uiRdfd")
    4727                    .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4728                    .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4729            $C$DW$424       .dwtag  DW_TAG_member
    4730                    .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$29)
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE   98

    4731                    .dwattr $C$DW$424, DW_AT_name("uiWrfd")
    4732                    .dwattr $C$DW$424, DW_AT_TI_symbol_name("uiWrfd")
    4733                    .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4734                    .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4735            $C$DW$425       .dwtag  DW_TAG_member
    4736                    .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$29)
    4737                    .dwattr $C$DW$425, DW_AT_name("uiExfd")
    4738                    .dwattr $C$DW$425, DW_AT_TI_symbol_name("uiExfd")
    4739                    .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4740                    .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4741                    .dwendtag $C$DW$T$56
    4742            
    4743            $C$DW$T$185     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdSelectRecvParams")
    4744                    .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$56)
    4745                    .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    4746            
    4747            $C$DW$T$58      .dwtag  DW_TAG_structure_type
    4748                    .dwattr $C$DW$T$58, DW_AT_name("_sockaddr_t")
    4749                    .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    4750            $C$DW$426       .dwtag  DW_TAG_member
    4751                    .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$23)
    4752                    .dwattr $C$DW$426, DW_AT_name("sa_family")
    4753                    .dwattr $C$DW$426, DW_AT_TI_symbol_name("sa_family")
    4754                    .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4755                    .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4756            $C$DW$427       .dwtag  DW_TAG_member
    4757                    .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$57)
    4758                    .dwattr $C$DW$427, DW_AT_name("sa_data")
    4759                    .dwattr $C$DW$427, DW_AT_TI_symbol_name("sa_data")
    4760                    .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4761                    .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4762                    .dwendtag $C$DW$T$58
    4763            
    4764            $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("sockaddr")
    4765                    .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$58)
    4766                    .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4767            $C$DW$T$106     .dwtag  DW_TAG_pointer_type
    4768                    .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$50)
    4769                    .dwattr $C$DW$T$106, DW_AT_address_class(0x10)
    4770            $C$DW$T$191     .dwtag  DW_TAG_const_type
    4771                    .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$106)
    4772            $C$DW$T$110     .dwtag  DW_TAG_const_type
    4773                    .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$50)
    4774            $C$DW$T$111     .dwtag  DW_TAG_pointer_type
    4775                    .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
    4776                    .dwattr $C$DW$T$111, DW_AT_address_class(0x10)
    4777            $C$DW$T$192     .dwtag  DW_TAG_const_type
    4778                    .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$111)
    4779            
    4780            $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4781                    .dwattr $C$DW$T$61, DW_AT_name("timeval")
    4782                    .dwattr $C$DW$T$61, DW_AT_byte_size(0x08)
    4783            $C$DW$428       .dwtag  DW_TAG_member
    4784                    .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$59)
    4785                    .dwattr $C$DW$428, DW_AT_name("tv_sec")
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE   99

    4786                    .dwattr $C$DW$428, DW_AT_TI_symbol_name("tv_sec")
    4787                    .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4788                    .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4789            $C$DW$429       .dwtag  DW_TAG_member
    4790                    .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$60)
    4791                    .dwattr $C$DW$429, DW_AT_name("tv_usec")
    4792                    .dwattr $C$DW$429, DW_AT_TI_symbol_name("tv_usec")
    4793                    .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4794                    .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4795                    .dwendtag $C$DW$T$61
    4796            
    4797            $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    4798                    .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$61)
    4799                    .dwattr $C$DW$T$100, DW_AT_address_class(0x10)
    4800            $C$DW$T$193     .dwtag  DW_TAG_const_type
    4801                    .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$100)
    4802                    .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4803            
    4804            ;***************************************************************
    4805            ;* DWARF CIE ENTRIES                                           *
    4806            ;***************************************************************
    4807            
    4808            $C$DW$CIE       .dwcie 16
    4809                    .dwcfi  cfa_register, 1
    4810                    .dwcfi  cfa_offset, 0
    4811                    .dwcfi  same_value, 0
    4812                    .dwcfi  same_value, 1
    4813                    .dwcfi  undefined, 2
    4814                    .dwcfi  same_value, 3
    4815                    .dwcfi  same_value, 4
    4816                    .dwcfi  same_value, 5
    4817                    .dwcfi  same_value, 6
    4818                    .dwcfi  same_value, 7
    4819                    .dwcfi  same_value, 8
    4820                    .dwcfi  same_value, 9
    4821                    .dwcfi  same_value, 10
    4822                    .dwcfi  undefined, 11
    4823                    .dwcfi  undefined, 12
    4824                    .dwcfi  undefined, 13
    4825                    .dwcfi  undefined, 14
    4826                    .dwcfi  undefined, 15
    4827                    .dwcfi  undefined, 16
    4828                    .dwendentry
    4829            
    4830            ;***************************************************************
    4831            ;* DWARF REGISTER MAP                                          *
    4832            ;***************************************************************
    4833            
    4834            $C$DW$430       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("PC")
    4835                    .dwattr $C$DW$430, DW_AT_location[DW_OP_reg0]
    4836            $C$DW$431       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SP")
    4837                    .dwattr $C$DW$431, DW_AT_location[DW_OP_reg1]
    4838            $C$DW$432       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SR")
    4839                    .dwattr $C$DW$432, DW_AT_location[DW_OP_reg2]
    4840            $C$DW$433       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("CG")
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:03 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0632010                         PAGE  100

    4841                    .dwattr $C$DW$433, DW_AT_location[DW_OP_reg3]
    4842            $C$DW$434       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r4")
    4843                    .dwattr $C$DW$434, DW_AT_location[DW_OP_reg4]
    4844            $C$DW$435       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r5")
    4845                    .dwattr $C$DW$435, DW_AT_location[DW_OP_reg5]
    4846            $C$DW$436       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r6")
    4847                    .dwattr $C$DW$436, DW_AT_location[DW_OP_reg6]
    4848            $C$DW$437       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r7")
    4849                    .dwattr $C$DW$437, DW_AT_location[DW_OP_reg7]
    4850            $C$DW$438       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r8")
    4851                    .dwattr $C$DW$438, DW_AT_location[DW_OP_reg8]
