MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:05 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0627211                         PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                             PC v4.3.1 *
       3            ;* Date/Time created: Wed Oct 01 17:44:04 2014                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=coffabi --hll_source=on --mem_model:code=large --mem_model:data=small --o
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("C:/ti/CC3000 SDK/MSP430FR5739/Basic WiFi Application/Basic WiFi 
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen PC v4.3.1 Copyright (c) 2003-2014 Te
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\CC3000 SDK\MSP430FR5739\Basic WiFi Application\Basic W
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SimpleLinkWaitEvent")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("SimpleLinkWaitEvent")

    3259            ;* ABSTRACTED PROCEDURE: $abproc3                                            *
    3260            ;*****************************************************************************
    3261 00028a       $abproc3:
    3262                    .dwcfi  cfa_offset, 4
    3263 00028a 0FCC          MOVA      r15,r12               ; [] |641| 
    3264 00028c 411D          MOV.W     18(SP),r13            ; [] 
         00028e 0012 
    3265 000290 411E          MOV.W     20(SP),r14            ; [] 
         000292 0014 
    3266 000294 13B0!         CALLA     #UINT32_TO_STREAM_f   ; [] |641| 
         000296 0000 
    3267                                                      ; [] |641| 
    3268 000298 0110          RETA      ; [] 
    3269                    ; [] 
    3270                    .dwendentry
    3271                    .dwendtag $C$DW$268
    3272            
    3273 00029a               .sect   ".text:wlan_add_profile"
    3274            
    3275            $C$DW$269       .dwtag  DW_TAG_subprogram, DW_AT_name("")
    3276                    .dwattr $C$DW$269, DW_AT_low_pc($abproc4)
    3277                    .dwattr $C$DW$269, DW_AT_high_pc(0x00)
    3278                    .dwattr $C$DW$269, DW_AT_TI_symbol_name("$abproc4")
    3279            
    3280                    .dwfde $C$DW$CIE, $abproc4
    3281            
    3282            ;*****************************************************************************
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:05 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0627211                         PAGE   67

    3283            ;* ABSTRACTED PROCEDURE: $abproc4                                            *
    3284            ;*****************************************************************************
    3285 00029a       $abproc4:
    3286                    .dwcfi  cfa_offset, 4
    3287 00029a 531F          ADD.W     #1,r15                ; [] |674| 
    3288 00029c 4EFF          MOV.B     @r14+,-1(r15)         ; [] |674| 
         00029e FFFF 
    3289 0002a0 831D          SUB.W     #1,r13                ; [] |674| 
    3290 0002a2 0110          RETA      ; [] 
    3291                    ; [] 
    3292                    .dwendentry
    3293                    .dwendtag $C$DW$269
    3294            
    3295 0002a4               .sect   ".text:wlan_add_profile"
    3296            
    3297            $C$DW$270       .dwtag  DW_TAG_subprogram, DW_AT_name("")
    3298                    .dwattr $C$DW$270, DW_AT_low_pc($abproc5)
    3299                    .dwattr $C$DW$270, DW_AT_high_pc(0x00)
    3300                    .dwattr $C$DW$270, DW_AT_TI_symbol_name("$abproc5")
    3301            
    3302                    .dwfde $C$DW$CIE, $abproc5
    3303            
    3304            ;*****************************************************************************
    3305            ;* ABSTRACTED PROCEDURE: $abproc5                                            *
    3306            ;*****************************************************************************
    3307 0002a4       $abproc5:
    3308                    .dwcfi  cfa_offset, 4
    3309 0002a4 531F          ADD.W     #1,r15                ; [] |670| 
    3310 0002a6 4AFF          MOV.B     @r10+,-1(r15)         ; [] |670| 
         0002a8 FFFF 
    3311 0002aa 831E          SUB.W     #1,r14                ; [] |670| 
    3312 0002ac 0110          RETA      ; [] 
    3313                    ; [] 
    3314                    .dwendentry
    3315                    .dwendtag $C$DW$270
    3316            
    3317            ;*****************************************************************************
    3318            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    3319            ;*****************************************************************************
    3320                    .global SimpleLinkWaitEvent
    3321                    .global UINT32_TO_STREAM_f
    3322                    .global UINT16_TO_STREAM_f
    3323                    .global hci_command_send
    3324                    .global SpiOpen
    3325                    .global SpiClose
    3326                    .global hci_unsolicited_event_handler
    3327                    .global _Errno
    3328                    .global wlan_tx_buffer
    3329                    .global memset
    3330                    .global __mpyi
    3331            
    3332            ;******************************************************************************
    3333            ;* BUILD ATTRIBUTES                                                           *
    3334            ;******************************************************************************
    3335                    .battr "TI", Tag_File, 1, Tag_ABI_enum_size(3)
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:05 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0627211                         PAGE   68

    3336            
    3337            ;******************************************************************************
    3338            ;* TYPE INFORMATION                                                           *
    3339            ;******************************************************************************
    3340            
    3341            $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3342                    .dwattr $C$DW$T$46, DW_AT_byte_size(0x3e)
    3343            $C$DW$271       .dwtag  DW_TAG_member
    3344                    .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    3345                    .dwattr $C$DW$271, DW_AT_name("usRxEventOpcode")
    3346                    .dwattr $C$DW$271, DW_AT_TI_symbol_name("usRxEventOpcode")
    3347                    .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3348                    .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3349            $C$DW$272       .dwtag  DW_TAG_member
    3350                    .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    3351                    .dwattr $C$DW$272, DW_AT_name("usEventOrDataReceived")
    3352                    .dwattr $C$DW$272, DW_AT_TI_symbol_name("usEventOrDataReceived")
    3353                    .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3354                    .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3355            $C$DW$273       .dwtag  DW_TAG_member
    3356                    .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$21)
    3357                    .dwattr $C$DW$273, DW_AT_name("pucReceivedData")
    3358                    .dwattr $C$DW$273, DW_AT_TI_symbol_name("pucReceivedData")
    3359                    .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3360                    .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3361            $C$DW$274       .dwtag  DW_TAG_member
    3362                    .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$21)
    3363                    .dwattr $C$DW$274, DW_AT_name("pucTxCommandBuffer")
    3364                    .dwattr $C$DW$274, DW_AT_TI_symbol_name("pucTxCommandBuffer")
    3365                    .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3366                    .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3367            $C$DW$275       .dwtag  DW_TAG_member
    3368                    .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$29)
    3369                    .dwattr $C$DW$275, DW_AT_name("sFWPatches")
    3370                    .dwattr $C$DW$275, DW_AT_TI_symbol_name("sFWPatches")
    3371                    .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3372                    .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3373            $C$DW$276       .dwtag  DW_TAG_member
    3374                    .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$30)
    3375                    .dwattr $C$DW$276, DW_AT_name("sDriverPatches")
    3376                    .dwattr $C$DW$276, DW_AT_TI_symbol_name("sDriverPatches")
    3377                    .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3378                    .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3379            $C$DW$277       .dwtag  DW_TAG_member
    3380                    .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$31)
    3381                    .dwattr $C$DW$277, DW_AT_name("sBootLoaderPatches")
    3382                    .dwattr $C$DW$277, DW_AT_TI_symbol_name("sBootLoaderPatches")
    3383                    .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3384                    .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3385            $C$DW$278       .dwtag  DW_TAG_member
    3386                    .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$35)
    3387                    .dwattr $C$DW$278, DW_AT_name("sWlanCB")
    3388                    .dwattr $C$DW$278, DW_AT_TI_symbol_name("sWlanCB")
    3389                    .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3390                    .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:05 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0627211                         PAGE   69

    3391            $C$DW$279       .dwtag  DW_TAG_member
    3392                    .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$38)
    3393                    .dwattr $C$DW$279, DW_AT_name("ReadWlanInterruptPin")
    3394                    .dwattr $C$DW$279, DW_AT_TI_symbol_name("ReadWlanInterruptPin")
    3395                    .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3396                    .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3397            $C$DW$280       .dwtag  DW_TAG_member
    3398                    .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$41)
    3399                    .dwattr $C$DW$280, DW_AT_name("WlanInterruptEnable")
    3400                    .dwattr $C$DW$280, DW_AT_TI_symbol_name("WlanInterruptEnable")
    3401                    .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3402                    .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3403            $C$DW$281       .dwtag  DW_TAG_member
    3404                    .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$42)
    3405                    .dwattr $C$DW$281, DW_AT_name("WlanInterruptDisable")
    3406                    .dwattr $C$DW$281, DW_AT_TI_symbol_name("WlanInterruptDisable")
    3407                    .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3408                    .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3409            $C$DW$282       .dwtag  DW_TAG_member
    3410                    .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$45)
    3411                    .dwattr $C$DW$282, DW_AT_name("WriteWlanPin")
    3412                    .dwattr $C$DW$282, DW_AT_TI_symbol_name("WriteWlanPin")
    3413                    .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3414                    .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3415            $C$DW$283       .dwtag  DW_TAG_member
    3416                    .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$32)
    3417                    .dwattr $C$DW$283, DW_AT_name("slTransmitDataError")
    3418                    .dwattr $C$DW$283, DW_AT_TI_symbol_name("slTransmitDataError")
    3419                    .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3420                    .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3421            $C$DW$284       .dwtag  DW_TAG_member
    3422                    .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    3423                    .dwattr $C$DW$284, DW_AT_name("usNumberOfFreeBuffers")
    3424                    .dwattr $C$DW$284, DW_AT_TI_symbol_name("usNumberOfFreeBuffers")
    3425                    .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3426                    .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3427            $C$DW$285       .dwtag  DW_TAG_member
    3428                    .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
    3429                    .dwattr $C$DW$285, DW_AT_name("usSlBufferLength")
    3430                    .dwattr $C$DW$285, DW_AT_TI_symbol_name("usSlBufferLength")
    3431                    .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3432                    .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3433            $C$DW$286       .dwtag  DW_TAG_member
    3434                    .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    3435                    .dwattr $C$DW$286, DW_AT_name("usBufferSize")
    3436                    .dwattr $C$DW$286, DW_AT_TI_symbol_name("usBufferSize")
    3437                    .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3438                    .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3439            $C$DW$287       .dwtag  DW_TAG_member
    3440                    .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    3441                    .dwattr $C$DW$287, DW_AT_name("usRxDataPending")
    3442                    .dwattr $C$DW$287, DW_AT_TI_symbol_name("usRxDataPending")
    3443                    .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3444                    .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3445            $C$DW$288       .dwtag  DW_TAG_member
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:05 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0627211                         PAGE   70

    3446                    .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$25)
    3447                    .dwattr $C$DW$288, DW_AT_name("NumberOfSentPackets")
    3448                    .dwattr $C$DW$288, DW_AT_TI_symbol_name("NumberOfSentPackets")
    3449                    .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3450                    .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3451            $C$DW$289       .dwtag  DW_TAG_member
    3452                    .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$25)
    3453                    .dwattr $C$DW$289, DW_AT_name("NumberOfReleasedPackets")
    3454                    .dwattr $C$DW$289, DW_AT_TI_symbol_name("NumberOfReleasedPackets")
    3455                    .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3456                    .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3457            $C$DW$290       .dwtag  DW_TAG_member
    3458                    .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$20)
    3459                    .dwattr $C$DW$290, DW_AT_name("InformHostOnTxComplete")
    3460                    .dwattr $C$DW$290, DW_AT_TI_symbol_name("InformHostOnTxComplete")
    3461                    .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3462                    .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3463                    .dwendtag $C$DW$T$46
    3464            
    3465            $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("sSimplLinkInformation")
    3466                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$46)
    3467                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3468            $C$DW$T$49      .dwtag  DW_TAG_volatile_type
    3469                    .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3470            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3471                    .dwattr $C$DW$T$2, DW_AT_name("void")
    3472            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3473                    .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3474                    .dwattr $C$DW$T$3, DW_AT_address_class(0x10)
    3475            $C$DW$T$52      .dwtag  DW_TAG_const_type
    3476                    .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$3)
    3477            
    3478            $C$DW$T$33      .dwtag  DW_TAG_subroutine_type
    3479                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3480            $C$DW$291       .dwtag  DW_TAG_formal_parameter
    3481                    .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$32)
    3482            $C$DW$292       .dwtag  DW_TAG_formal_parameter
    3483                    .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$24)
    3484            $C$DW$293       .dwtag  DW_TAG_formal_parameter
    3485                    .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$20)
    3486                    .dwendtag $C$DW$T$33
    3487            
    3488            $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3489                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    3490                    .dwattr $C$DW$T$34, DW_AT_address_class(0x14)
    3491            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanCB")
    3492                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3493                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3494            $C$DW$T$55      .dwtag  DW_TAG_const_type
    3495                    .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$35)
    3496            
    3497            $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    3498                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3499            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3500                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
MSP430 Assembler PC v4.3.1 Wed Oct 01 17:44:05 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\x0135533\AppData\Local\Temp\0627211                         PAGE   71

    3501                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    3502            $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptDisable")
    3503                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    3504                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3505            $C$DW$T$58      .dwtag  DW_TAG_const_type
    3506                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$42)
    3507            $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptEnable")
    3508                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3509                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3510            $C$DW$T$59      .dwtag  DW_TAG_const_type
    3511                    .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$41)
    3512            
    3513            $C$DW$T$43      .dwtag  DW_TAG_subroutine_type
    3514                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3515            $C$DW$294       .dwtag  DW_TAG_formal_parameter
    3516                    .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
